{
  "houzzReviewsURL": "https://www.houzz.com/professionals/building-designers-and-drafters/jaz-design-inc-pfvwus-pf~629149421",
  "reviews": [
    {
      "name": "Jenny Gutzebahl",
      "testimonial": "Working with Aimee was a delight! From planning the initial design (which I love!), to selecting a contractor, to shopping for materials, to making sure the project stayed on track, Aimee provided support and guidance.  This was my first major renovation, and I was extremely nervous about almost every aspect of it, but having Aimee to bounce ideas off and to share her experience gave me confidence.  Aimee also dealt with almost every problem that arose, from materials not arriving on time (or not being quite right) to non-responsive contractors.  I'm incredibly grateful I didn't have to do this project alone, and would recommend JAZ design to anyone who is looking to revamp their space.",
      "stars": 5
    },
    {
      "name": "ata29",
      "testimonial": "Aimee did an excellent job with the design of our home renovation.  We renovated nearly our entire home, including renovating our kitchen, dining room, 1.5 renovated bathrooms, an additional master bath, and converting the unfinished attic into usable square footage. Our initial consultation with her went well, and Aimee had already demonstrated in that initial meeting her experience renovating homes. She was able to tell us which of our ideas were feasible, and which weren't. She recommended a general contractor to us, which we ended up choosing to go with. Aimee produced detailed plans for the renovation, including before and after for each space being renovated, with all fixtures. In particular, converting closets to a full bathroom + walk-in closet in our main bedroom was a challenge that we would not have been able to solve without her help. During the renovation, she helped us choose tile, lighting, paint colors, and other fixtures. We almost always went with one of her recommendations, and she knew our style very well as we continued to work with her. She was able to give us what we wanted (wainscoting, penny tile, etc), and still make the rooms cohesive. Aimee made the process of working with the contractor, and other vendors much easier.  When our existing countertops were accidentally demo'd (when they were supposed to stay according to her plans), Aimee worked with the contractor to make sure they were replaced. When the wrong slab of granite was installed for our island countertop, Aimee quickly found us another slab we loved, and got the new slab installed quickly. She has been our advocate through every step of the process. We love the end result, and are so incredibly glad we chose Aimee as our designer. She produced layouts we would not have thought of ourselves, helped pick out finishes we love, and made the process much easier and much more enjoyable than it would have been otherwise. We would absolutely recommend working with Aimee for a home renovation.",
      "stars": 5
    },
    {
      "name": "HU",
      "testimonial": "Aimee is great to work with and really takes the time to get to know you, your style and the goals of your project. She helps guide you in the timing of decision making and helps to narrow your focus which helps make the process seem less overwhelming. She is also a great advocate and communicates with the contractor and team regularly regarding the project plans and needs and helps guide adjustments that may need to happen as your project moves forward. Overall, she is great to work with.",
      "stars": 5
    },
    {
      "name": "Amy K",
      "testimonial": "The design process for our project has been a long one.  This is our first experience with a large scale project, and Aimee has patiently guided us through each step of the process.  She listens closely when we express concerns or desires, makes recommendations from her experience, lets us make decisions, and reflects it all back to us in her design.  I am grateful to have connected with her.",
      "stars": 5
    },
    {
      "name": "Linda & Jules Gardener",
      "testimonial": "We very highly recommend Aimee from JAZ Design. This was the second time we've hired her for a renovation project - this time for an upstairs re-configuration, including a new laundry room and bathroom. Aimee's wonderful to work with and her main focus is to give you a custom space that you'll love. She listens carefully, finds creative solutions, helps you stick to budget and works hard to make the project a success. Her eye for design and understanding of your personal style, sets her apart (she even made picking out tile painless)! We look forward to working again with Aimee on any future home upgrades.",
      "stars": 5
    },
    {
      "name": "76",
      "testimonial": "My project involved gutting a kitchen and two full baths as well as a wall removal. Aimee designed the kitchen footprint, which was creative, functional and specific to my needs. She listened, made appropriate suggestions and efficiently executed my decisions. She has many resources where she has established relationships. She has a wonderful manner and sense of humor. Her interaction with my contractors was clear and respectful. Under her guidance, the kitchen and bathrooms have a cohesive and aesthetically pleasing impact. She is a joy!",
      "stars": 5
    },
    {
      "name": "Pete Fried",
      "testimonial": "We worked with Aimee and JAZ Design for our first ever home renovation project. She helped us understand the process and set our expectations. She came up with an excellent design for our new kitchen, bathroom, and outside deck/porch that got us everything we were looking for within our budget. She has a lot of fantastic ideas and doesn't shy away from offering her opinions, but is good at listening to what is important to the client and defers when appropriate. You really get the feeling that her main priority is 100% satisfaction from the client. She helped us find a Contractor who could offer a competitive bid (no small feat in 2022) and was an active participant in the planning and execution of the project. Her rates are fair and transparent. She does a lot of research behind the scenes to offer options for various appliances and design elements. I have and will continue to recommend her to others.",
      "stars": 5
    },
    {
      "name": "Gyrfalcon General Contracting",
      "testimonial": "Gyrfalcon General Contracting has worked on four projects with Aimee in 2022. Two projects in construction and two projects in development. There are many good things to say about Aimee but there are three key points that we think are critical in creating an environment for project success: respect for her clients' budgets while in the design process, collaborative approach with the General Contractor and availability during the construction process. We have worked closely with Aimee, offering budget advice, during her design process. For us to be involved in the budgeting process early has worked well for her clients. It is great as a contractor to not have to be the one to break the news to a homeowner that their design professional has drawn something that is simply not buildable on their budget. We appreciate her respect for our expertise in bringing a build budget to aid her design process that yields a set of project drawings that her clients can afford to execute. Her willingness to collaborate with us early has proven to be successful and is appreciated. Aimee also appreciates that her input during the construction process makes for a finished project that aligns well with her clients' expectations and vision. Things happen in the field that don't necessarily happen on paper. She fully appreciates that there are unknowns in the existing conditions that will not be revealed until demolition of the affected spaces are complete. Aimee is prepared for surprises, often accurately anticipating them, and is ready to provide guidance to us quickly so we can keep projects on schedule.",
      "stars": 5
    },
    {
      "name": "Stephanie Valerio",
      "testimonial": "Very knowledgeable and efficient. Really grasps your ideas and finds the right style you are looking for. She used our ideas as a starting point and created something better than we could have imagined. Would highly recommend working with Aimee at JAZ Design, Inc.",
      "stars": 5
    },
    {
      "name": "maddydem",
      "testimonial": "Aimee was an absolute pleasure to work with during our house remodel.  We were the clients who knew nothing about the remodeling process; we didn't even know where to begin.  And we also didn't especially know what we wanted except that we no longer wanted what we had.  Aimee started the process by asking us what we didn't like about our current space and we gave her a long list.  Then she asked us what features we did want in our new space.  And based on our messy ramblings, she redesigned our dark, dingy, and segmented living space and kitchen into a bright, airy and spacious area.  Aimee was also completely pragmatic and kept us on budget when our desires started to stray off target in the middle of the project.  In addition to giving us an amazingly functional redesigned space, she helped us pick out finishes.  She was on her hands and knees in our house laying out a pattern for an incredibly complicated kitchen backsplash.  She came to the granite warehouse, helped us choose paint colors, and even helped us pick out furnishings.  As an animal lover, Aimee understood how much we loved our two cats and created a custom cabinet where we could keep the litter box.  We felt incredibly comfortable working with Aimee; no detail went unnoticed and we trusted her completely.  We would absolutely work with her again.",
      "stars": 5
    },
    {
      "name": "Jenny Vernick",
      "testimonial": "Aimee was fantastic to work with! My house is a small city apartment, and Aimee designed it in such a way that it is easily livable, functional, and beautiful. Throughout the entire COVID pandemic and being inside basically 24/7 I never got sick of my apartment. She took into consideration my preferences, and prioritized all the specific requests that I had. I highly recommend working with Aimee!",
      "stars": 5
    },
    {
      "name": "Linda & Jules Gardener",
      "testimonial": "We worked with Aimee of Jaz Designs on a kitchen and bathroom project. The project involved re-imagining our kitchen/dining space, and relocating a powder room for the main floor. Aimee was focused on realizing our vision with her design, and was very open to our quirky requests. She listened to our ideas in a non-judgmental way, and genuinely wanted to create a space we would be happy with. She provided guidance on where to pull back on the original design to make the project more affordable, and delivered the design drawings for City approval in a timely manner. Her pricing was fair, with no surprises, and she was comfortable with the idea that not everything needed to be new. We had a good in-person connection with Aimee, and she seems to have very positive relationships with her vendors. The people she works with and recommends are excellent. As a bonus, she loves animals and was very thoughtful about our cats!",
      "stars": 5
    },
    {
      "name": "H2",
      "testimonial": "Aimee of Jaz Design has done two top notch big bathroom renovations for me in Cambridge. She was very creative and resourceful in finding and obtaining excellent tile materials as well as addressing my goals and collaboration with the contractor. I highly recommend her services",
      "stars": 5
    },
    {
      "name": "H1",
      "testimonial": "Beautiful and thoughtful designs for any space. We have worked together on a range of projects.  Aimee possesses a rare combination of brilliant designs and a fundamental understanding of how the building process is done.",
      "stars": 5
    },
    {
      "name": "Monica Tesoriero",
      "testimonial": "My husband and I were very fortunate to work with Aimee on designing and remodeling the kitchen and bathroom in our rental apartment. Aimee was very conscious of our challenges both in terms of budget and timeframe and truly helped us maximize resources without compromising quality.  She was extremely professional in every interaction and showed a deep sense of respect and partnership. She took time to first understand what we wanted before exploring a few design options with us. Aimee thought of configurations, colors, finishes, and textures we hadn't considered and was able to materialize her vision for the space without compromising our desired outcome. The end result was breathtaking, and we can confidently say that her design work transformed the kitchen and bathroom, elevating the apartment to a higher-end level. In short, working with Aimee was a real pleasure. She is diligent, reliable, and very attentive to the needs of her clients. She is a designer with an exquisite taste, a keen eye for detail, and a warm personality that makes you feel at ease during the daunting process of remodeling a space. We are extremely grateful to Aimee and highly recommend her work.",
      "stars": 5
    },
    {
      "name": "Cheryl Vernick",
      "testimonial": "We hired Aimee for a huge renovation, including an addition, of our over 100yr old, two family home. We chose her based on photos of her work as well as the reviews on houzz. We are just getting ready to start the demolition/building phase of the project so I will be speaking about the design and preparation. The project is projected to be complete in approximately 8 months. We have been so pleased with everything about Aimee throughout this process. During our first few meetings she took so much time getting to know us, our home, what we were looking for, plus our must haves, and throughout the design process has remembered all the details and worked tirelessly to give us the design for the home we envisioned. Our budget is pretty inflexible so she has been working closely with the builders who will work on our project to find ways of designing the physical spaces and new systems like plumbing, heating, and electrical to keep costs down. We have been included in all of this through meetings with the whole team, and to approve drawings and plans. Aimee is so thorough and has worked hard to iron out any issues that might arise during the construction phase that will throw us off our budget, and she has had awesome ideas to enhance our vision in ways we didn't even know existed. She has a great esthetic and although we need to be careful with our budget, keeping the charm of our home is as important to her as it is to us. As we get ready to actually begin the work on our house we feel so fortunate that Aimee is in charge. She really listens and cares. She is thorough and attentive. She always responds quickly to any questions we have and she is a lot of fun to work with. We knew she was a keeper on our first visit because she loved our pets and they loved her too! This is our first time renovating and this is our first and forever home. We have lived here for 22 years and have such deep feelings for this place which Aimee has totally understood and embraced in all our interactions and in her wonderful designs. She and her team have our complete trust moving forward and we can't wait to see the results!",
      "stars": 5
    },
    {
      "name": "Julie-Aurore Losman",
      "testimonial": "Aimee is wonderful to work with. She is very creative and collaborative. When she and I worked together, she would listen very carefully to what I was thinking and then tailor her suggestions to conform as much as possible to the frame-work of my vision. That said, when she disagreed with my ideas she made it clear why she felt they would not work and she found ways to get around any problems that came up. I will absolutely work with her again!",
      "stars": 5
    },
    {
      "name": "mindyslo",
      "testimonial": "We just completed an extensive renovation with Aimee. We liked her instantly from the first meeting - she was so warm in personality and practical in her approach. She was attentive to detail and ensured that all aspects of the design were carried through to her standards. The plans that Aimee came up with for how to re-work our layout were genius - although I'd spent years thinking about our space, her ideas were so much better. Aimee also kept an eye on costs when I found myself getting carried away picking out fixtures, and I am grateful for that as well! I have already recommended her to multiple people.",
      "stars": 5
    },
    {
      "name": "Colleen Beacham",
      "testimonial": "We spent a lot of time trying to find someone to work with that understood what we wanted from our project.  Aimee worked with us to make our key decisions along the way.  We are extremely pleased with the results and wouldn't change a thing. Aimee has excellent relationships with everyone we worked with, from the general contractor to the cabinet contact to the counter tops! Thank you!",
      "stars": 5
    },
    {
      "name": "Brandon Marks",
      "testimonial": "My company fabricates and installs kitchen and bathroom counter tops. I've been in the business for 8 years now and worked with hundreds of general contractors and designers. I can honestly say from day one Aimee has always been the most educated, detail oriented, and enjoyable professional to work with.  After one meeting with her you can understand her dedication to the craft and everything that goes into it.  Over the past 8 years I've worked with Aimee on at least forty different homes, ranging from Downtown Boston, to old fashioned Brookline, to up and coming Somerville.  Her range of talent and ability to give the home owner what they want is truly a gift.  If you're looking to remodel your house you would be lucky to have Jaz Design be a part of the process.",
      "stars": 5
    },
    {
      "name": "Gina C",
      "testimonial": "Aimee is a pleasure to work with. She has also been very creative and patient with us. She created a design based on our needs and then re-drew it to better suit our budget. She has also been very patient through the legal and review process as our renovation project has been challenged by owners of a unit below us who are afraid of any changes to the building. Other designers/project managers may have given up on us and our project, but Aimee has stuck by us.",
      "stars": 5
    },
    {
      "name": "Laura Adamic",
      "testimonial": "Noting but positive things to say about working with JAZ Design. We contracted with Aimee to help my parents downsize from a 5-bedroom suburban house in the Midwest to a 1200-square foot condo in Boston. She has been an integral part of their transition! Aimee approached the project with the perfect combination of professionalism and warmth. She is equally confident in her expertise as she is compassionate and a good listener. I appreciate her style, her patience, and her humor. In addition, Aimee's use of technology to assist us in visualizing the plans for my parents' new space was incredibly helpful. We feel so fortunate to have found her!",
      "stars": 5
    },
    {
      "name": "Carrie M",
      "testimonial": "We recently decided to add a bathroom on the first floor to our house which was proving to be quite challenging as it also meant we'd have to redo our counterless/cabinetless kitchen. As neither of us are skilled in the art of construction/blueprints, we relied on the expertise of others.  After speaking with a few contractors regarding the project and feeling more lost than when we started, we decided to meet with Aimee for guidance, and couldn't be happier. Aimee was quick to respond to our cry for help, spent almost 3 hours with us on the initial meeting, explained, in detail, what the project would entail *(paperwork, permitting, blueprints, timelines) and stressed that she didn't want us to go beyond our means. Keeping the customer happy and able to sleep at night is her main goal. Aimee got to know us as a team. She asked for  our wish list and 'must have' list and any other information we could provide. (magazie cut outs, Houzz boards, you name it!) Once the drafts were complete, we were blown away by the details and how great she made the space look. The kitchen/bathroom/mudroom (yes, bonus!) flows nicely and does't look or seem cramped at all. You barely notice that the 3/4 bathroom is right off the kitchen! We're looking forward to the execution of the project and continuing our working relationship with Aimee and her team. We will definitely continue to use Aimee for all future projects.",
      "stars": 5
    },
    {
      "name": "Jennifer Hollis",
      "testimonial": "We've been working with JAZ Design, Inc for more than a year on a large project. Aimee was recommended by a friend, so we were already familiar with her beautiful work. She has a unique gift for hearing and understanding what we are looking for, and to offer ideas and solutions that we never would have thought of. Do yourself a favor and contact her for your project.",
      "stars": 5
    },
    {
      "name": "Mark V",
      "testimonial": "We went with Jaz Design for a gut remodel of our kitchen and master bath and were very pleased with the process and outcome. Aimee did a great job listening to our vision and came up with some creative ideas to maximize the openness and functionality of our space.  She readily incorporated feedback into plan revisions and stayed true to the proposed budget. After the design phase, we stuck with Aimee for construction management and material sourcing. We worked with one of her preferred contractors (St. George Construction, who did a wonderful job executing the plans) and her hand selected suppliers, all of whom were excellent and were value adds to the project. Aimee is efficient, professional, and adaptable and won't steer you wrong. She will give you options to choose from but will be candid about her opinion. We highly recommend her and would be delighted to work with her on future projects.",
      "stars": 5
    },
    {
      "name": "Stephanie plent",
      "testimonial": "I really enjoy working with Aimee.  She is professional and organized but also fun. She works to understand your needs by assessing the way you live, gives opinions and advice that you need without prejudice. She tries to make things work to what you actually want, rather than just settling with the easiest option.  We are in the middle of a long project, she came in late but has taken on all that I have asked so far and is willing to make it work with other professionals involved.  I truly appreciate her flexibility.",
      "stars": 5
    },
    {
      "name": "Katia Green",
      "testimonial": "After living in our attached single-family home for 14 years, we did a gut renovation going from ~1,100 square feet to ~1,700 square feet.  Aimee worked with us as project manager and designer for nearly a full year, January-November 2016. (The one down side of being done with the renovation is not having an excuse to work with Aimee anymore!). Aimee isresourceful, hands-on,knowledgable, pragmatic when necessary and fanciful when there's room for it, has an unfailing artist's eye for detail and quality, is a full team member with the contractor's crew and has the respect of everyone on board, brings a sense of joy and dedication to the work at hand, is a pro at helping us navigate choices and deadlines, listens attentively to our preferences, opinions, and needs, and helps to turn it all into a space which feels, as it should, like home.",
      "stars": 5
    },
    {
      "name": "Patricia Small",
      "testimonial": "I have found Aimee Zazlow (JAZ Design) to be both easy and pleasant to work with. She was able to grasp the concept I was looking for in a bathroom remodel, and improve on it with her expertise. The contractors she works with are worth their weight in gold, for their excellent craftsmanship, respecting the house, cleaning up after themselves, and great communication. Both Aimee and the contractors hold themselves to the highest standards of excellence. I am more than happy with the job done, and would hire her again in a heartbeat.",
      "stars": 5
    },
    {
      "name": "onlyonecolleen",
      "testimonial": "Aimee is a tireless, efficient and thoughtful professional. We are renovating a beautiful in law apartment and moving our stairs to accommodate the space. Everything must be to code for this task. Aimee makes herself familiar with codes, electrical and plumbing placement, handicapped accessible situations, as well as beautiful designs. There isn't anything she can't do!  We have worked together before and will be working with her on our next project as well, a kitchen/living space and master suite addition!",
      "stars": 5
    },
    {
      "name": "Jociane Hong",
      "testimonial": "I loved working with Aimee. She is a non ordinary professional. She really listen to our needs and  respects our personal preferences without compromising the new project. She delivered to us our dream place!",
      "stars": 5
    },
    {
      "name": "Donal Reynolds",
      "testimonial": "Aimee did a fantastic job with the design of our addition and kitchen remodel. She did a great job of incorporating our thoughts on want we wanted with her own vision of the project. Being able to see the 3D renderings really helped us get a feel for the layout and flow of the new space. She assisted us in a very difficult town planning process which required multiple meetings and redesigns and came up with solutions to all the 'concerns' the town had. Overall we thoroughly enjoyed working with Aimee and are so happy with the results. I would highly recommend Aimee for any project.",
      "stars": 5
    },
    {
      "name": "mbam",
      "testimonial": "Aimee is a true professional.   She is so knowledgeable and thinks of everything!  I found her on Houzz and contacted her because of the excellent reviews.  The initial scope of my project was to update my kitchen and upstairs bathroom, and add a bathroom downstairs.  I ended up changing to a whole gut renovation and she was great.   From the outside the house still has the look of the cute, picturesque Cape which is what I wanted.  She was able to gain me so much more space inside by bumping out in the back and it made such a huge difference.  And the roof lines look great!  Her idea and plan fit perfectly with what I was looking for.  I used her for the plans and project managed myself, and in hindsight it would have been better to have her project manage it!  She is super.",
      "stars": 5
    },
    {
      "name": "Harison Hong",
      "testimonial": "After reading outstanding reviews of Aimee and some of her project at Houzz we decided to hire JAZ Design to renovate our apartment in Brookline that we recently bought. For us was a critical component to hire someone that could have a PM responsibility as well because we were moving interstate from NJ to MA. Therefore, having someone who could be on top of the project and that we could trust was a must needed. We knew from our fist meeting that we did the right choice and Aimee was the one for the renovation of our unit.  She was very attentive to our needs and was able to instantly capture our style and clearly understand what we wanted. She was amazing from beginning to end:  kept us updated through entire project; had an incredible flexibility to meet us in the weekends; very accessible through emails and telephone to answer any questions; managed very well our tight budget prioritizing cost but without compromising quality. Aimee is extremely knowledge, professional and nice to work with. She was always involved and knew everything that was happing in our project. It was truly a joy to work with her and hassle free. Our new kitchen exceeded our expectations and the whole apt finished looks just fabulous. We worked with her preferable contractor - Stealth Construction - that were highly professional, knowledgeable, and trustworthy. We would highly recommend Aimee. She is amazing!",
      "stars": 5
    },
    {
      "name": "M Gill",
      "testimonial": "We hired JAZ Design to renovate our master bath.  Aimee designed an impressive layout and the results are amazing.  She was able to deliver what we wanted on time and within our budget.  We never had to worry about the details of the job because Aimee was on top of things from the beginning to the end.  She kept us updated throughout the process and was always a phone call away to answer questions.  The contractors were highly professional, knowledgeable, and trustworthy.  We cannot be happier with the new bathroom.  It was a pleasure working with Aimee and her team.  We plan on using JAZ Design for future projects.",
      "stars": 5
    },
    {
      "name": "delfgill",
      "testimonial": "I had an amazing experience working with Aimee and JAZ Design on my bathroom renovation.  I knew from our first meeting that Aimee was the one for the project.  Aimee was very attentive to my needs and designed the perfect bathroom.  She was present at every stage of the renovation to ensure the project stayed on course.  Aimee is extremely knowledge, professional, fun to work with and, most important, a genuinely nice person.  The new bathroom exceeded my expectations and the finished look takes my breath away.  She delivered everything I wanted and more.  I highly recommend Aimee and look forward to working with her on other home projects.  She is amazing!",
      "stars": 5
    },
    {
      "name": "Stealth Construction",
      "testimonial": "We started working with Aimee from Jaz Design a few years ago. Working with Aimee has been a great experience for many reasons. First and foremost her professionalism and attention to detail is top notch! She's very organized, which is super important and helpful no matter what size project. She ensures all items are ordered and ready to go. Working with someone with all these great skills is a dream come true. Our clients love Aimee because she makes them feel comfortable and helps them every step of the way. From gathering all their ideas, to putting it on a 3rd rendering, picking out wall colors, fabrics, cabinetry, lights, and tile. Those are just a few things that Aimee does. She really knows how to balance working with the client and the contractor. We always recommend our clients to Aimee because we know she will provide them with the best service. We always look forward to working with Aimee from Jaz Design!",
      "stars": 5
    },
    {
      "name": "Tricia Sullivan",
      "testimonial": "Thanks to Aimee at JAZ Design my vision of a new kitchen/dining room has come to life. From initial consultation, design plans, hiring a contractor, and numerous decisions along the way she has been a pleasure to work with,  always available and flexible with changes . She has great attention to detail and a wonderful design sensibility that is personalized to her client's lifestyle . Highly recommend.",
      "stars": 5
    },
    {
      "name": "Allan",
      "testimonial": "We purchased a three family house last year and wanted to renovate the second floor apartment to be our 'in town' home away from home. The idea of designing and managing a job of this magnitude was daunting but we were concerned about losing control of the design if we hired a design professional. We'd seen that on many home reno TV shows the designers seem to always do their same thing. Long story short, we chose a few designers from Houzz and met with them. I'd say we hit it off with Aimee immediately and hired her. The experience has been wonderful. She has been very sensitive to our styles and has provided invaluable design advice. In addition, she connected us with a range of very competent tradesmen and craftsmen and served as the project manager and contractor coordinator. The end result is spectacular! We did a complete gut renovation of the kitchen and bath as well as fairly extensive updates to the rest of the apartment. We've got a number of really cool custom built-ins, including a full size bed that hides in the window seat. I can't recommend Aimee highly enough. Though I'm glad that the apartment is finished, I'm sorry that our work with Aimee is near the end.",
      "stars": 5
    },
    {
      "name": "awtlb",
      "testimonial": "We found Aimee through Houzz while looking for a Designer who had done work in Somerville.  I had never worked with a designer before and was worried that I was going to end up with a space that looked like it was designed by --- instead of my space.  Working with Aimee couldn't have been further from that experience. It was a true collaboration, she totally got what we were going for and together we created the perfect place.  We did a gut reno of a kitchen and bathroom as well as updating all the other rooms including many custom built-ins.  She was involved in all aspects of the project from initial design concepts through project management and the final punch list.  It was a total joy to work with her, I hate to see it end.  I can't recommend her highly enough. If you are hesitating about working with a designer because you are worried that you will be pressured to do a certain look or anything that you might not be comfortable with, call Aimee, she is amazing and you will love her.",
      "stars": 5
    },
    {
      "name": "lucyvb",
      "testimonial": "Aimee was instrumental in turning our vision into a reality.  Our project was unusual - turning a triple decker from the early 1900s into a modern, open-concept two-family home.  Aimee came highly recommended and we enjoyed her collaborative work style.  She listened to our ideas and needs, made great suggestions, and worked diligently to put together 3-D renderings so that we could envision our finished project.  Besides having great taste in decor, Aimee also has a designer's eye and captured the look/layout we wanted while staying within our budget.  We highly recommend working with Aimee - she is a true and talented professional!",
      "stars": 5
    },
    {
      "name": "deborahvarat",
      "testimonial": "We had a wonderful experience with Aimee Zaslaw, a designer at JAZ.  She was so helpful and absolutely in tune with whatever we said.  She was very flexible in working with our complicated schedules, was extremely prompt with communication, and so pleasant that I hope we can be friends now that the project is over.  Also, she had great ideas that fit perfectly with my taste that really improved the way the kitchen came out.  And, we found the fee quite reasonable.",
      "stars": 5
    },
    {
      "name": "Katey Smith",
      "testimonial": "We had our kitchen and bathroom renovated. Aimee was great to meet our needs (within our budget and fast turnaround). She was acting as a project manager through the whole time. And she went out of her way to deal with our granite company when they made a mistake on sink cutout. Because of her, we got a huge discount on the granite. Overall, she is excellent! I would go back to her again if needed.",
      "stars": 5
    },
    {
      "name": "kantorji",
      "testimonial": "Aimee did an amazing job for us, pre, during and after our 1960 kitchen and dining rooms  were demolished and recreated  into a large open  floor concept kitchen/dining room. She was involved in all aspects of the renovation.  She did the design and worked hand in hand with Kitchen Designs  to ensure that there were no issues with measurements, color, design, color, flaws etc.with our cabinets and Stealth Construction, the contractor. on each level of the renovation from demolition  to pink sheet follow-up. She also assisted us in our decision making by providing us samples of everything to make all of our decisions re: lighting, paint, floor, counters, back splash so much easier. We were so impressed with what she did with the kitchen that  we asked her to redesign our floor to ceiling pink tiled bathroom . The bathroom was also demolished . She worked with us to find the right tile, counters. and fixtures We went from a one to a 2 sink bathroom and the room  seems to have so much more space than before!  We added a sun tunnel over the tub which provides great natural light for the room and .keeps the room bright. Months after the renovation, there were some minor issues which were quickly resolved by Aimee.  I would recommend Aimee to anyone looking to work with a talented and honest professional!",
      "stars": 5
    },
    {
      "name": "ctowncas",
      "testimonial": "Everything about my condo renovation got easier after I met Aimee. She was completely in synch with the look and feel I wanted to convey and she presented so many great options. While I appreciated her guidance and help on all of the aspects she worked on, the tiles (for kitchen, bath and and art wall in the foyer) and the lighting were truly amazing. She also helped me set up the main living space, which was a non-descript rectangle, into three distinct areas that made the room a lot more interesting yet totally comfortable and livable. I have recommended Aimee several times and will continue to do so.",
      "stars": 5
    },
    {
      "name": "reillymom",
      "testimonial": "Aimee was super creative and attentive to what our wishes were for our new kitchen.  She saved us money by finding discounts and lower cost merchants, without sacrificing on quality.  She's very easy to work with, professional but also warm and accessible.  Her design and interface with our contractor immeasurably helped our project turn out great.",
      "stars": 5
    },
    {
      "name": "micamom",
      "testimonial": "Aimee is the best. Amazing customer service. Very talented designer. Great listener and very knowledgeable. I am very grateful for all of her advice along with her caring and supportive nature! I also have referred Aimee to my important clients and they felt the same about their experience.",
      "stars": 5
    },
    {
      "name": "lineartinc",
      "testimonial": "I hired Jaz Design to design my kitchen for a  home that was being built from the ground up in 2012. Aimee was wonderful to work with. She had the ability to see my vision and make it come to life. It turned out better than I imagined and has become the hub of our new home. Aimee was incredibly professional. She was always available to answer any questions that we had and made some amazing suggestions about the design and details of our  new kitchen. I would highly recommend Jaz Design and plan on using Jaz Designs services again in the future for our second home.",
      "stars": 5
    },
    {
      "name": "kmac",
      "testimonial": "Amy was recommended to me by a friend to design my kitchen.  Amy was a very hands on person when it came to designing my kitchen, she came by and looked the area over, made suggestions, coordinated with various contractors and in the end I had a fantastic kitchen.",
      "stars": 5
    },
    {
      "name": "Jennifer Leahy",
      "testimonial": "This is my second time using Jaz Design Inc. I had Aimee design a kitchen for me @5 years ago and have recently sold that property.  A common theme many prospective buyers commented on was how impressive the kitchen was. Aimee has been a pleasure to work with, she is a true professional.  She alway kept my needs at the forefront of the design while maintaining the budget and functionality.  My current kitchen she designed was not an easy task. Wall space was minimal and I wanted to use some exiting cabinets.  I couldn't be happier for the second time. I highly recommend Jaz Design Inc. services to anyone. You will not be disappointed!",
      "stars": 5
    },
    {
      "name": "Bob Russo",
      "testimonial": "I only wish there were more stars (5 is not enough). I am a 30 + year professional in the kitchen & bath industry.  I started to work with Aimee of Jaz Design several years ago,  quite by chance.  One of our employees was working with her on a project, left the company and I was asked to set in to finish up.    Well time moves on and  13 + projects later;  working with this lady is just Impressive.   Whether your project is on a tight budget or an open budget;  Aimee puts  the same time into the planning and then execution.    Aimee's ability provide onsite planing  info and produce job plans/  computer renderings, to be able to give her customers a view of their future renovated  space(s) , is amazing,  takes all the guess work away. Aimee, truly loves what she does (and it shows), if you get a chance to work with her,  you will see firsthand what I mean. I enjoy being able to work alongside such a dedicated professional, such as Aimee of Jaz Design.",
      "stars": 5
    },
    {
      "name": "djc",
      "testimonial": "Aimee was great to work with during our renovation project. She took the time to understand how we wanted to live and designed the space around us. With Aimee's help we were able to balance what we wanted, what we needed and what we could afford. We would welcome the opportunity to work with Aimee again!",
      "stars": 5
    },
    {
      "name": "Bobbie Block",
      "testimonial": "My sister and brother in law utilized Aimee's services to design the newly expanded area in which the kitchen and dining room were previously located and turn it into an enormous kitchen. Because it was my sister's home, I was often there and had the opportunity to meet and get to know Aimee. Even though I was also planning a kitchen remodel, my plans didn't include a professional to design and guide me through the process. Because of her personality, professionalism, knowledge, vision and the fact that I was able to actually see her transform my sister's kitchen into a “Home Beautiful” kitchen, I also hired Aimee! Working with Aimee was the best decision I could have made! Her desire to make sure I was happy & aware of every step in her designs and ideas were refreshing. Communication is very important to me. When I'm allocating $50,000 to be budgeted on a project I definitely want to be kept in the loop, which she always did. Aimee was always on top of the actual build too. She met or communicated with the general contractor, painter, granite, electrician, plumber, cabinet and appliance people. Her measurements were so accurate that the cabinet installer said it was the easiest installation they had ever done. That is just one example of how amazing her work is! Obviously I have nothing but rave reviews for Aimee's services. In fact, the kitchen was completed last August and now remodeling the bathrooms as well as my master suite are all underway. Of course I have hired Aimee once again because I can't think of anyone I would trust more with designing my home!",
      "stars": 5
    },
    {
      "name": "joniblock",
      "testimonial": "We are thrilled with how our house came out! Aimee from JAZ Design, Inc. provided consultation before, during, and after construction. My husband and I expanded our home and added on a new kitchen, great room, and deck as well as resdesigned our kitchen. She really listened to what our needs and desires were and designed the spaces to best suit us! She even suggested extra design features we had not thought of but absolutely LOVE!. Aimee was available for phone consult, she went with us shopping for tile and lights, and emailed design specs whenever we requested them. She is very professional and accommodating. I would hire her again if I needed her services.",
      "stars": 5
    },
    {
      "name": "Robert Leal",
      "testimonial": "I recommend Aimee for her design and colour sense, her professionalism, her positive attitude, her get-r-done attitude, and her organizational and management skills in preparing many of the projects that we have undertaken with her since 2005. Over the years, she has demonstrated a strong commitment and dedication to servicing her clients and making sure that they get what was agreed upon. Before a project starts, she ensures that all items and parts for bathroom, kitchen or entire home renovations are ordered and waiting. This process of hers makes the execution and completion of our projects attainable and therefore very happy clients. It also makes me very happy as there are no delays from start to finish. I would highly recommend Aimee or Jaz Design to anyone looking for someone who is as committed and passionate about her work. Can't wait for our next project!!!!!!",
      "stars": 5
    },
    {
      "name": "Elizabeth Hunter",
      "testimonial": "We hired JAZ Design to handle the design elements of a gut & rebuild of our new home. Aimee Zazlow  was a joy to work with. She clearly understood our needs, taste and priorities and worked with us very patiently to be sure everything was perfect. She designed beautiful spaces with creative and innovative solutions to maximize the useful area of our home. In the latter phases of the project she found gorgeous and unusual decorative elements that really express our aesthetic ideals and was tireless is searching out exactly the right colors and fabrics for us. She identified appropriate vendors for specific items and services and managed the relationships with those vendors scrupulously. Throughout the project she was pleasant, patient, responsive and responsible. I recommend JAZ Design very highly and would hire the company again for any future project.",
      "stars": 5
    },
    {
      "name": "66vic",
      "testimonial": "In the total-gut rehab of our antique home, Aimee created our construction drawings and then guided us in everything from lay-out to paint colors. We wouldn't do a single thing differently in our house.  She's great!  Aimee's knowledge about tile is huge and her color expertise is phenomenal-- 'on-trend' and responsive to our taste.  She has worked with many of her vendors for a long time.  She consistently offered us a range of choices and gave us the information we needed to make good decisions. She's innovative, timely, and willing to go the extra mile.   She wanted our home to be beautiful, practical, and an expression of us, which it is!",
      "stars": 5
    },
    {
      "name": "devalency",
      "testimonial": "Aimee came out with great ideas and overall design for the entire condo. She very well took into consideration the views - Boston harbor and connected it into the streaming design, using the right materials. Aimee well captured my interest in clean, contemporary lines yet, sophisticated design and took it several levels up by eliminating components that would overload or confuse the eye. The overall result is almost identical to the 3D rendering and I'm very happy with the results.",
      "stars": 5
    },
    {
      "name": "hannahmamuszka",
      "testimonial": "We did a complete gut and remodel of almost our entire home, and Aimee did all of the design work, from conception to execution, including the kitchen and great room, two bathrooms, 3 bedrooms. We had the best experience, from start to finish. She got to know us and had an amazing understanding of our style, and was able to make suggestions and streamline the whole process. We couldn't be happier with how it came out. We get continuous compliments from everyone who sees our house, particularly on the kitchen, and have recommended Aimee and Jaz Design to everyone we talk to.",
      "stars": 5
    }
  ]
}
